var app = {};
app.translations = {
  ru: {
    home: "Главная",
    about: "О нас",
    parents: "Родителям",
    educators: "Учителям",
    faq: "Вопросы",
    currated_collection: "тщательно подобранная коллекция высококачественных материалов <br> для родителей и педагогов детей от 0 до 6 лет ",
    get_started: "Начать",
    im_an_educator: '<i class="fas fa-graduation-cap" style="margin-right: 10px;"></i>Я воспитатель',
    im_a_parent: 'Я родитель <i class="fas fa-user-friends" style="margin-left: 10px;"></i>',
    activities_and_games_front: "Занятий и игр",
    activities_and_games_back_title: "Занятия и игры",
    activities_and_games_back_desk: "Стимулирующие занятия для родителей и учителей, направленные на поддержку раннего языка и математики, искусства и творчество и социально-эмоциональное обучение детей от рождения до 6 лет.",
    click_here: "Начать",
    courses_for_educators: "Курсов для педагогов",
    lesson_plans: "Планов урока",
    tips_guides: "Советы и руководства",
    learning_at_home: "Обучение дома",
    learning_at_home_desc: "Обучение происходит везде, а не только в школе. Родители и опекуны могут поддерживать рост и развитие своих маленьких детей с помощью занятий, не требующих изысканных или дорогих материалов. Такие занятия, как разговор, пение, чтение книг и задание вопросов, развивают важные языковые навыки и навыки грамотности в раннем возрасте. Замечание закономерностей, форм и чисел в повседневной среде закладывает основу для дальнейшего изучения математики. Игра с маленькими детьми показывает им, как решать проблемы, выражать эмоции и создавать связи с заботливыми взрослыми.  ",
    read_more_about_lah: "Узнать больше об обучении дома",
    resources_for_preschool: "Ресурсы для дошкольных воспитателей",
    resources_for_preschool_desc: "От работы по управлению своими эмоциями до изучения букв, звуков и чисел в дошкольном возрасте дети заняты обучением каждый день. Если вы педагог дошкольного образования, вы найдете качественный  ресурсы для поддержки вашей работы с детьми дошкольного возраста. Планы уроков, занятия и игры, советы  курсы обучения и повышения квалификации организованы по возрастным группам и областям обучения, включая  социально-эмоциональное обучение, игра и творчество, ранняя математика и решение проблем и язык, грамотность и общение.",
    read_more_about_res: "Подробнее о ресурсах для преподавателей",
    looking_for_ways: "Ищете способы заинтересовать вашего ребенка?",
    first_section_lfw: "Язык, грамотность и общение",
    first_section_lfw_desc: "Развитие языковых навыков и навыков грамотности начинается с рождения во время общения с заботой. взрослые читают книги, поют, разговаривают и рассказывают истории. По мере взросления дети развиваются  язык, разговаривая, слушая и слушая взрослых Образец для подражания правильное чтение, слушая читать вслух.",
    first_section_ps_em: "Решение задач и ранняя математика",
    first_section_ps_em_desc: "Ресурсы в этой категории помогают детям развивать позитивные отношения со взрослыми и другими детьми.  и как управлять эмоциями и выражать их. По очереди, учиться делиться, быть добрым и чутким являются важными навыками, которые дети усваивают в раннем возрасте.",
    second_section_pc: "Игра и творчество",
    second_section_pc_desc: "Маленькие дети развивают понимание математических понятий, таких как больше и меньше, сложение и вычитание, размер и местоположение в повседневных взаимодействиях. В этом разделе вы найдете творческие советы и увлекательные игры, в которые можно играть со своим маленьким ребенком, чтобы развить первые математические навыки.",
    second_section_sel: "Социальное эмоциональное обучение",
    second_section_sel_desc: "Ресурсы в этом разделе поддерживают развитие творческих способностей, воображения и физических навыков, таких как баланс и мелкая моторика. Родители и преподаватели найдут здесь советы, игры и инструкции по игре. поддерживает важные когнитивные навыки, а также решение проблем и выражение эмоций.",
    partners: "Партнеры",
    lpu_footer: "Learning Passport от Unicef - Обеспечение постоянного доступа к образование для детей и молодежи по всему миру",
    
    /*страница about lp*/
    a_about_lp: "О LP",
    a_about_lp_desc: "Новое решение, призванное сократить разрыв в образовании бедности, Learning Passport техническая платформа, обеспечивающая качественное и гибкое обучение. Learning Passport - это результат сотрудничества между ЮНИСЕФ, Microsoft и Кембриджским университетом для решения проблем, с которыми сталкиваются более 30 миллионов доступ детей и молодежи к непрерывному качественному образованию из-за сбоев, вызванных кризисом и смещение.",
    a_our_mission: "Наша миссия",
    a_our_mission_desc: "Обеспечить непрерывный доступ к образованию для детей и молодежи во всем мире и способствовать улучшению результатов обучения за счет высококачественного портативного образования, чтобы поддержать их вступление в другие образование или возможности, включая формальное образование.",
    a_million: "387 миллионов",
    a_million_desc: "дети младшего школьного возраста, которые не достигнут минимального уровня владения чтение и математика",
    a_million_2: "30 миллионов",
    a_million_2_desc: "дети, которые либо не ходят в школу, либо учеба была нарушена из-за конфликт и чрезвычайная ситуация",
    a_covid_19: "Covid-19",
    a_covid_19_desc: "Когда началась глобальная пандемия, и школы закрылись во всем мире Learning Passport быстро расширился. Теперь все страны с учебной программой возможность обучаться онлайн, сможет облегчить онлайн-обучение для детей и молодежи с устройства в домашних условиях.",
    a_covid_19_desc_2: "Косово, Тимор-Лешти и Украина - которые закрыли свои школьные ворота за последние недели, чтобы помочь остановить передачу вируса - они первыми развернули свои онлайн-учебная программа через Learning Passport. Контент, доступный школьникам, включает в себя онлайн книги, видео и дополнительная поддержка для родителей детей с ограниченными возможностями обучения.",
    a_lp_world:"Learning Passport в Мире",
    
    /*страница родителей*/
    par_title: "Родители",
    par_desc: "Родители могут узнать больше о том, как поддерживать рост и развитие детей младшего возраста. от рождения до шести лет с играми, занятиями, советами и рекомендациями по различным темам, в том числе о том, как поддержать детей с ограниченными возможностями.",
    par_how: "Как родители могут получить пользу от Learning Passport?",
    par_how_desc: "Обучение происходит везде, а не только в школе. Родители и опекуны могут поддержать их рост и развитие маленьких детей с помощью занятий, не требующих изысканных или дорогих материалов. Такие занятия, как разговор, пение, чтение книг и задание вопросов, развивают важный язык и рано навыки грамотности. Замечание узоров, форм и чисел в повседневной среде закладывает основу для позднее изучение математики. Игра с маленькими детьми показывает им, как решать проблемы, выражать эмоции и создавать связи с заботливыми взрослыми. Поддерживать и развивать эти навыки дома легко с помощью ресурсы в Learning Passport.",
    par_activites_and_games: "Мероприятия и игры",
    par_activites_and_games_desc: "Ресурсы для родителей и педагогов дошкольного образования, которые ищут игры и занятия с маленькими детьми в возрасте от рождения до шести лет.",
    par_tips_guide: "Советы и рекомендации",
    par_tips_guide_desc: "Полезные советы и рекомендации для родителей и педагогов дошкольного образования о том, как поддерживать социально-эмоциональное развитие детей, как читать детям вслух и как поддерживать детей с инвалидность дома и в классе.",
    par_go_actv: "Перейти к мероприятиям и играм",
    par_go_tips: "Перейти к советам и рекомендациям",
    par_first_tab_line : '<i class="fas fa-home"></i> Играть дома',
    par_second_tab_line: '<i class="fas fa-route"></i> Активный отдых на открытом воздухе',
    par_third_tab_line: '<i class="fas fa-child"></i> Уровни взаимодействия',
  },
  tj: {
    home: "Асосӣ",
    about: "Дар бораи мо",
    parents: "Барои волидайн",
    educators: "Барои муаллимон",
    faq: "Саволҳо",
    currated_collection: "коллексияи бодиққат интихобшудаи маводҳои баландсифат <br> барои волидон ва мураббиёни кӯдакони аз 0 то 6 сола ",
    get_started: "Оғоз",
    im_an_educator: '<i class="fas fa-graduation-cap" style="margin-right: 10px;"></i>Ман омӯзгорам',
    im_a_parent: 'Ман волидайн <i class="fas fa-user-friends" style="margin-left: 10px;"></i>',
    activities_and_games_front: "Фаъолият ва бозиҳо",
    activities_and_games_back_title: "Фаъолият ва бозиҳо",
    activities_and_games_back_desk: "Ҳавасмандгардонии дарсҳо барои волидон ва муаллимон барои дастгирии забони барвақтӣ ва математика, санъат ва эҷодкорӣ ва омӯзиши иҷтимоӣ-эмотсионалӣ барои кӯдакони аз таваллуд то 6-сола.",
    click_here: "Оғоз",
    courses_for_educators: "Курсҳо барои муаллимон",
    lesson_plans: "Нақшаҳои дарс",
    tips_guides: "Маслиҳатҳо ва дастурҳо",
    learning_at_home: "Таҳсили хонагӣ",
    learning_at_home_desc: "Омӯзиш дар ҳама ҷо рух медиҳад, на танҳо дар мактаб. Волидон ва парасторон метавонанд бо афзалиятҳо ва рушди кӯдакони хурдсоли худ бо машғулиятҳое, ки маводи нозук ва гаронарзишро талаб намекунанд, дастгирӣ кунанд. Фаъолиятҳое чун сухан гуфтан, суруд хондан, китоб хондан ва савол додан малакаҳои муҳими забон ва саводро дар синни хурдсолӣ инкишоф медиҳанд. Дар шароити ҳаррӯзаи худ мушоҳида кардани нақшҳо, шаклҳо ва рақамҳо барои омӯзиши минбаъдаи математика асос мегузорад. Бозӣ бо кӯдакони хурдсол ба онҳо нишон медиҳад, ки чӣ гуна ҳалли мушкилот, изҳори эҳсосот ва эҷоди робитаҳо бо калонсолони ғамхор. ",
    read_more_about_lah: "Маълумоти бештар",
    resources_for_preschool: "Манбаъҳо барои мураббиёни томактабӣ",
    resources_for_preschool_desc: "Аз кор барои идоракунии эҳсосоти худ то омӯхтани ҳарфҳо, садоҳо ва рақамҳо дар муассисаҳои томактабӣ, кӯдакон ҳар рӯз ба омӯхтани машғуланд. Агар шумо мураббии томактабӣ бошед, манбаҳои сифатнокро барои дастгирии кор бо кӯдакони томактабӣ пайдо мекунед. Нақшаҳои дарсҳо, фаъолиятҳо ва бозиҳо, маслиҳатҳо, курсҳои омӯзишӣ ва таълими давомдор аз рӯи гурӯҳҳои синну сол ва соҳаи таҳсил, аз ҷумла омӯзиши иҷтимоӣ-эмотсионалӣ, бозӣ ва эҷодкорӣ, математикаи барвақтӣ ва ҳалли масъалаҳо ва забон, савод ва муошират ташкил карда мешаванд.",
    read_more_about_res: "Маълумоти бештар",
    looking_for_ways: "Дар ҷустуҷӯи роҳҳои шавқманд кардани фарзандатон ҳастед?",
    first_section_lfw: "Забон, савод ва муошират",
    first_section_lfw_desc: "Инкишофи малакаҳои забонӣ ва саводнокӣ аз таваллуд тавассути муоширати ғамхорона оғоз меёбад. калонсолон китоб мехонанд, суруд мехонанд, сӯҳбат мекунанд ва ҳикояҳо мекунанд. Вақте ки онҳо калонтар мешаванд, кӯдакон бо инкишоф додани сухан, гӯш кардан ва гӯш кардани калонсолон забон инкишоф медиҳанд.",
    first_section_ps_em: "Ҳалли масъалаҳо ва математикаи ибтидоӣ",
    first_section_ps_em_desc: "Захираҳои ин гурӯҳ ба кӯдакон дар рушди муносибатҳои мусбӣ бо калонсолон ва дигар кӯдакон кӯмак мерасонанд. ва чӣ гуна идора ва ифодаи эҳсосот. Гирифтани навбати худ мубодила кардан, меҳрубон ва ҳамдард будан малакаҳои муҳимест, ки кӯдакон дар синни хурдӣ меомӯзанд.",
    second_section_pc: "Бозӣ ва эҷодкорӣ",
    second_section_pc_desc: "Кӯдакони хурдсол фаҳмиши мафҳумҳои математикиро, аз қабили бештар ва камтар, илова ва тарҳ, андоза ва ҷойгоҳро дар муносибатҳои ҳаррӯза ташаккул медиҳанд. Дар ин бахш, шумо маслиҳатҳои эҷодӣ ва бозиҳои шавқовар пайдо мекунед, ки бо кӯдаки хурдсоли худ барои рушди малакаҳои аввалини математикии худ бозӣ кунанд.",
    second_section_sel: "Омӯзиши эҳсосотии иҷтимоӣ",
    second_section_sel_desc: "Захираҳои ин бахш рушди эҷодкорӣ, тахайюл ва малакаҳои ҷисмонӣ, ба монанди тавозун ва малакаҳои хуби моторикиро дастгирӣ мекунанд. Волидон ва мураббиён маслиҳатҳо, бозиҳо ва дастурҳо барои бозӣ дар инҷо пайдо мекунанд. малакаҳои муҳими маърифатӣ, инчунин ҳалли мушкилот ва ифодаи эҳсосотро дастгирӣ мекунад.",
    partners: "Шарикон",
    lpu_footer: "Learning Passport аз Unicef - Таъмини дастрасии доимӣ ба таҳсилот барои кӯдакон ва ҷавонон дар саросари ҷаҳон",
    
      /*страница about lp*/
      a_about_lp: "Дар бораи LP",
      a_about_lp_desc: "Як ҳалли наве, ки барои рафъи холигии камбизоатӣ дар соҳаи маориф пешбинӣ шудааст, Passport Learning як платформаи техникист, ки омӯзиши босифат ва фасеҳро фароҳам меорад. Шиносномаи омӯзишӣ натиҷаи ҳамкориҳои ЮНИСЕФ, Майкрософт ва Донишгоҳи Кембриҷ барои ҳалли мушкилотест, ки беш аз 30 миллион кӯдакон ва ҷавонон ба таҳсилоти доимии босифат дар натиҷаи халалҳо дар натиҷаи бӯҳрон ва ҷойивазкунӣ рӯ ба рӯ шудаанд.",
      a_our_mission: "Вазифаи мо",
      a_our_mission_desc: "Таъмини дастрасии давомдори кӯдакон ва ҷавонон дар саросари ҷаҳон ва баланд бардоштани натиҷаҳои омӯзиш тавассути таҳсилоти баландсифати сайёр барои дастгирии вуруди онҳо ба дигар таҳсилот ё имкониятҳо, аз ҷумла таҳсилоти расмӣ.",
      a_million: "387 миллион",
      a_million_desc: "кӯдакони синну соли ибтидоӣ, ки ба ҳадди ақали малакаи хондан ва математика намерасанд",
      a_million_2: "30 миллион",
      a_million_2_desc: "кӯдаконе, ки ё ба мактаб намераванд ва ё таҳсилашон бо сабаби муноқиша ва ҳолати фавқулодда вайрон шудааст",
      a_covid_19: "Covid-19",
      a_covid_19_desc: "Вақте ки пандемияи глобалӣ оғоз ёфт ва мактабҳо дар саросари ҷаҳон баста шуданд, шиносномаи омӯзишӣ босуръат васеъ шуд. Акнун ҳамаи кишварҳое, ки барномаи таълимии онлайн доранд, метавонанд омӯзиши онлайнро барои кӯдакон ва ҷавонон аз дастгоҳи хона осон кунанд.",
      a_covid_19_desc_2: "Косово, Тимор-Лесте ва Украина, ки дар ҳафтаҳои охир дарвозаҳои мактабҳои худро бастанд, то ба қатъи интиқоли вирус мусоидат кунанд - аввалин шуда, барномаи таълимии худро тавассути омӯзиши шиноснома паҳн мекунанд. Мазмуни дастраси мактаббачагон дорои китобҳои онлайн, видео ва дастгирии иловагӣ барои волидони кӯдакони маъюб мебошад.",
      a_lp_world:"Learning Passport дар Дунё",

    /*страница родителей*/
    par_title: "Волидайн",
    par_desc: "Волидон метавонанд дар бораи дастгирии афзоиш ва рушди кӯдакони хурдсол маълумоти бештар гиранд. аз таваллуд то шашсола бо бозиҳо, фаъолиятҳо, маслиҳатҳо ва ҳилаҳо дар мавзӯъҳои гуногун, аз ҷумла чӣ гуна дастгирии кӯдакони имконияташон маҳдуд.",
    par_how: " Чӣ гуна волидон аз Learning Passport манфиат гирифта метавонанд",
    par_how_desc: "Омӯзиш дар ҳама ҷо рух медиҳад, на танҳо дар мактаб. Волидон ва парасторон метавонанд бо афзалият ва рушди кӯдакони хурдсол бо машғулиятҳое, ки маводи нозук ва гаронарзишро талаб намекунанд, дастгирӣ кунанд. Фаъолиятҳое чун сухан гуфтан, суруд хондан, китоб хондан ва савол додан малакаҳои муҳими забонӣ ва саводнокии барвақтро инкишоф медиҳанд. Дар ҳаёти ҳаррӯза мушоҳида кардани нақшҳо, шаклҳо ва рақамҳо барои омӯзиши баъдии математика замина фароҳам меорад. Бозӣ бо кӯдакони хурдсол ба онҳо нишон медиҳад, ки чӣ гуна ҳалли мушкилот, изҳори эҳсосот ва эҷоди робитаҳо бо калонсолони ғамхор. Нигоҳ доштан ва инкишоф додани ин малакаҳо дар хона бо манбаҳои Learning Passport осон аст.",
    par_activites_and_games: "Фаъолият ва бозиҳо",
    par_activites_and_games_desc: "Манбаъҳо барои волидон ва мураббиёни кӯдакии барвақт, ки дар ҷустуҷӯи бозӣ ва фаъолият бо кӯдакони хурдсол аз таваллуд то шашсола мебошанд.",
    par_tips_guide: "Маслиҳатҳо ва ҳилаҳо",
    par_tips_guide_desc: "Маслиҳатҳо ва ҳилаҳои муфид барои волидон ва мураббиёни кӯдакии барвақт дар бораи дастгирии рушди иҷтимоиву эҳсосии кӯдакон, тарзи хондани бачаҳо ва чӣ гуна дастгирии кӯдакони маъюб дар хона ва дар синф.",
    par_go_actv: "Ба машғулиятҳо ва бозиҳо равед",
    par_go_tips: "Ба маслиҳатҳо ва ҳилаҳо гузаред",
    par_first_tab_line : '<i class="fas fa-home"></i> Бозиҳо дар хона',
    par_second_tab_line: '<i class="fas fa-route"></i> Фаъолиятҳои берунӣ',
    par_third_tab_line: '<i class="fas fa-child"></i> Сатҳи ҳамкорӣ',
  }
};
setLanguage(getCookie('lang') || 'en');
function setLanguage(language) {
  var x = getCookie('lang');
  if (x) {
    if(x != language){
      eraseCookie('lang');
      setCookie('lang',language,7);
    }
  }else{
    setCookie('lang',language,7);
  }
  document.documentElement.lang = language;
  var currentLanguage = getCookie('lang');

  app.lang = app.translations[currentLanguage] || app.translations.en;

  for (const property in app.lang) {
    // console.log(`${property}: ${app.lang[property]}`);
    if (document.getElementById(property) != null && currentLanguage != "en") {
      document.getElementById(property).innerHTML = app.lang[property];
      document.getElementById(property).style.fontFamily = 'OpenSans';
    }
  }
}

function setCookie(name, value, days) {
  var expires = "";
  if (days) {
    var date = new Date();
    date.setTime(date.getTime() + (days * 24 * 60 * 60 * 1000));
    expires = "; expires=" + date.toUTCString();
  }
  document.cookie = name + "=" + (value || "") + expires + "; path=/";
}
function getCookie(name) {
  var nameEQ = name + "=";
  var ca = document.cookie.split(';');
  for (var i = 0; i < ca.length; i++) {
    var c = ca[i];
    while (c.charAt(0) == ' ') c = c.substring(1, c.length);
    if (c.indexOf(nameEQ) == 0) return c.substring(nameEQ.length, c.length);
  }
  return null;
}
function eraseCookie(name) {
  document.cookie = name + '=; Path=/; Expires=Thu, 01 Jan 1970 00:00:01 GMT;';
}

